In [179]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

In [180]:
import seaborn as sb

In [181]:
import numpy

In [182]:
tables = pd.read_html('http://www.basketball-reference.com/leagues/NBA_2016_games.html')

### Note:
BeautifulSoup or lxml can be used if pages are more complicated. Otherwise read_html() will do the trick

In [183]:
games = tables[0]
games.head(2)

,Date,Start (ET),Visitor/Neutral,PTS,Home/Neutral,PTS.1,,.1,Attend.,Notes
0,"Tue, Oct 27, 2015",8:00 pm,Detroit Pistons,106,Atlanta Hawks,94,Box Score,NaN,19187,NaN
1,"Tue, Oct 27, 2015",8:00 pm,Cleveland Cavaliers,95,Chicago Bulls,97,Box Score,NaN,21957,NaN

In [184]:
type(games)

pandas.core.frame.DataFrame

In [185]:
games.columns

Index(['Date', 'Start (ET)', 'Visitor/Neutral', 'PTS', 'Home/Neutral', 'PTS.1',
       ' ', ' .1', 'Attend.', 'Notes'],
      dtype='object')

In [186]:
column_names = {'Date': 'date', 'Start (ET)': 'start', 'Visitor/Neutral':'away_team', 'PTS': 'away_points', 
               'Home/Neutral': 'home_team', 'PTS.1': 'home_points', ' ': 'box', ' .1': 'noVal', 'Notes': 'note'}

gamesN = (games.rename(columns=column_names)
         .dropna(thresh=5)
         [['date', 'away_team', 'away_points', 'home_team', 'home_points']]
         .assign(date = lambda x: pd.to_datetime(x.date, format='%a, %b %d, %Y'))
         .set_index('date', append=True)
         .rename_axis(['game_id', 'date'])
         .sort_index()
         )
gamesN.head(2)

,,away_team,away_points,home_team,home_points
game_id,date,,,,
0,2015-10-27,Detroit Pistons,106,Atlanta Hawks,94
1,2015-10-27,Cleveland Cavaliers,95,Chicago Bulls,97

In [187]:
test =  games.assign(Date = lambda x: pd.to_datetime(x.Date, format = '%a, %b %d, %Y'))
print(test.head(2))
test['Date2'] = test.Date.dt.strftime('%m/%d/%Y')
test.head(2)

        Date Start (ET)      Visitor/Neutral  PTS   Home/Neutral  PTS.1  \
0 2015-10-27    8:00 pm      Detroit Pistons  106  Atlanta Hawks     94
1 2015-10-27    8:00 pm  Cleveland Cavaliers   95  Chicago Bulls     97

               .1  Attend.  Notes
0  Box Score  NaN    19187    NaN
1  Box Score  NaN    21957    NaN

,Date,Start (ET),Visitor/Neutral,PTS,Home/Neutral,PTS.1,,.1,Attend.,Notes,Date2
0,2015-10-27,8:00 pm,Detroit Pistons,106,Atlanta Hawks,94,Box Score,NaN,19187,NaN,10/27/2015
1,2015-10-27,8:00 pm,Cleveland Cavaliers,95,Chicago Bulls,97,Box Score,NaN,21957,NaN,10/27/2015

In [188]:
games.head(2)

,Date,Start (ET),Visitor/Neutral,PTS,Home/Neutral,PTS.1,,.1,Attend.,Notes
0,"Tue, Oct 27, 2015",8:00 pm,Detroit Pistons,106,Atlanta Hawks,94,Box Score,NaN,19187,NaN
1,"Tue, Oct 27, 2015",8:00 pm,Cleveland Cavaliers,95,Chicago Bulls,97,Box Score,NaN,21957,NaN

#   documentation
pd.assign() does not change the original dataframe but only creates a new df with the new columns

In [189]:
df = pd.DataFrame({'sal':[123,34566,3445], 'age':[23,34,24], 'date': ['Tue, Oct 27, 2015', 
                   'Wed, Oct 28, 2015', 'Tue, Oct 27, 2015']})
df

   age               date    sal
0   23  Tue, Oct 27, 2015    123
1   34  Wed, Oct 28, 2015  34566
2   24  Tue, Oct 27, 2015   3445

In [190]:
df['dage'] = df.age*2
df

   age               date    sal  dage
0   23  Tue, Oct 27, 2015    123    46
1   34  Wed, Oct 28, 2015  34566    68
2   24  Tue, Oct 27, 2015   3445    48

In [191]:
df.date = pd.to_datetime(df.date, format = '%a, %b %d, %Y')
df

   age       date    sal  dage
0   23 2015-10-27    123    46
1   34 2015-10-28  34566    68
2   24 2015-10-27   3445    48

In [192]:
games.head(2)

,Date,Start (ET),Visitor/Neutral,PTS,Home/Neutral,PTS.1,,.1,Attend.,Notes
0,"Tue, Oct 27, 2015",8:00 pm,Detroit Pistons,106,Atlanta Hawks,94,Box Score,NaN,19187,NaN
1,"Tue, Oct 27, 2015",8:00 pm,Cleveland Cavaliers,95,Chicago Bulls,97,Box Score,NaN,21957,NaN

In [193]:
# melt is used to join two columns of a dataframe without disturbing the indexes
#pd.melt()

### Documentation
Some details on Lambda, Map, and Filter

In [194]:
#lambda can accept more than one variables
print((lambda x: x*5)(4))
print((lambda x,y: x+y)(3,5))

20
8

In [195]:
#Format of the map() is as below
#map(function, series)
for val in map(lambda x: np.pi*x*x, range(3)):
    print(val)

0.0
3.141592653589793
12.566370614359172

In [196]:
list(map(lambda x: np.pi*x*x, range(3)))

[0.0, 3.141592653589793, 12.566370614359172]

In [197]:
type(map(lambda x: np.pi*x*x, range(3)))

map

In [198]:
#Filter has the format filter(function, list)
#filter will return you the values of the list which when passed to the function returns True
list(filter(lambda x: x%2==0,(2,3,5,6))) #finding list of even numbers

[2, 6]

In [199]:
df = pd.DataFrame(np.floor(np.random.random((5,3))*10), columns=['A','B','C'], index=pd.date_range('1/1/2000', periods=5))

In [200]:
# df.apply() can be used to exeucte any function on the dataframe
df = df.apply(lambda x: x*x+2)
df

               A     B     C
2000-01-01  11.0  27.0  11.0
2000-01-02  83.0  83.0  18.0
2000-01-03   3.0  38.0  83.0
2000-01-04   6.0  11.0  27.0
2000-01-05  38.0   6.0  83.0

In [201]:
df['D P'] = df['A'].apply(lambda x: x+2)
df

               A     B     C   D P
2000-01-01  11.0  27.0  11.0  13.0
2000-01-02  83.0  83.0  18.0  85.0
2000-01-03   3.0  38.0  83.0   5.0
2000-01-04   6.0  11.0  27.0   8.0
2000-01-05  38.0   6.0  83.0  40.0

In [202]:
print(df*2)

                A      B      C    D P
2000-01-01   22.0   54.0   22.0   26.0
2000-01-02  166.0  166.0   36.0  170.0
2000-01-03    6.0   76.0  166.0   10.0
2000-01-04   12.0   22.0   54.0   16.0
2000-01-05   76.0   12.0  166.0   80.0

In [203]:
df.values

array([[11., 27., 11., 13.],
       [83., 83., 18., 85.],
       [ 3., 38., 83.,  5.],
       [ 6., 11., 27.,  8.],
       [38.,  6., 83., 40.]])

In [204]:
(lambda x: print(x.A))(df)

2000-01-01    11.0
2000-01-02    83.0
2000-01-03     3.0
2000-01-04     6.0
2000-01-05    38.0
Freq: D, Name: A, dtype: float64

In [205]:
print((lambda x:x*2)(df))

                A      B      C    D P
2000-01-01   22.0   54.0   22.0   26.0
2000-01-02  166.0  166.0   36.0  170.0
2000-01-03    6.0   76.0  166.0   10.0
2000-01-04   12.0   22.0   54.0   16.0
2000-01-05   76.0   12.0  166.0   80.0

In [206]:
df['A'].apply(lambda x: x+10)

2000-01-01    21.0
2000-01-02    93.0
2000-01-03    13.0
2000-01-04    16.0
2000-01-05    48.0
Freq: D, Name: A, dtype: float64

In [207]:
df[['A','B']]+10

               A     B
2000-01-01  21.0  37.0
2000-01-02  93.0  93.0
2000-01-03  13.0  48.0
2000-01-04  16.0  21.0
2000-01-05  48.0  16.0

In [208]:
df

               A     B     C   D P
2000-01-01  11.0  27.0  11.0  13.0
2000-01-02  83.0  83.0  18.0  85.0
2000-01-03   3.0  38.0  83.0   5.0
2000-01-04   6.0  11.0  27.0   8.0
2000-01-05  38.0   6.0  83.0  40.0

In [209]:
df[['A','B']]=df[['A','B']].apply(np.square)
df

                 A       B     C   D P
2000-01-01   121.0   729.0  11.0  13.0
2000-01-02  6889.0  6889.0  18.0  85.0
2000-01-03     9.0  1444.0  83.0   5.0
2000-01-04    36.0   121.0  27.0   8.0
2000-01-05  1444.0    36.0  83.0  40.0

In [210]:
df[['A','B']]=df[['A','B']]*df[['A','B']]
df

                     A           B     C   D P
2000-01-01     14641.0    531441.0  11.0  13.0
2000-01-02  47458321.0  47458321.0  18.0  85.0
2000-01-03        81.0   2085136.0  83.0   5.0
2000-01-04      1296.0     14641.0  27.0   8.0
2000-01-05   2085136.0      1296.0  83.0  40.0

In [211]:
df2 = pd.DataFrame(np.abs(np.random.randn(5, 3)), columns=['A', 'B', 'C'], index=pd.date_range('1/1/2000', periods=5))
df3=df2
df2.iloc[3:4] = np.nan

In [212]:
df2['A'] =df2['A'].apply(lambda x: 1 if x>1 else x)
df2

                   A         B         C
2000-01-01  0.292213  0.159910  0.014216
2000-01-02  0.878551  1.570928  0.339324
2000-01-03  1.000000  1.130099  0.509430
2000-01-04       NaN       NaN       NaN
2000-01-05  0.707459  1.469513  0.401389

In [213]:
df2.A[df2.A < 1] = 2
df2

              A         B         C
2000-01-01  2.0  0.159910  0.014216
2000-01-02  2.0  1.570928  0.339324
2000-01-03  1.0  1.130099  0.509430
2000-01-04  NaN       NaN       NaN
2000-01-05  2.0  1.469513  0.401389

In [214]:
df2[['A','B']] = 2
df2

              A    B         C
2000-01-01  2.0  2.0  0.014216
2000-01-02  2.0  2.0  0.339324
2000-01-03  2.0  2.0  0.509430
2000-01-04  2.0  2.0       NaN
2000-01-05  2.0  2.0  0.401389

In [215]:
df2.A[df2.A < 2]

Series([], Freq: D, Name: A, dtype: float64)

In [216]:
df2.A[df2.A == 2] = df2.A[df2.A == 2].apply(lambda x: x*5)
df2

               A    B         C
2000-01-01  10.0  2.0  0.014216
2000-01-02  10.0  2.0  0.339324
2000-01-03  10.0  2.0  0.509430
2000-01-04  10.0  2.0       NaN
2000-01-05  10.0  2.0  0.401389

In [239]:
dfn = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C' : np.random.random(8), 'D' : np.random.random(8)})
dfn

     A      B         C         D
0  foo    one  0.965191  0.711437
1  bar    one  0.503213  0.053014
2  foo    two  0.961961  0.771425
3  bar  three  0.754684  0.051522
4  foo    two  0.600043  0.138268
5  bar    two  0.399430  0.483790
6  foo    one  0.924232  0.357217
7  foo  three  0.529211  0.970615

In [240]:
dfn.groupby('A')

In [227]:
dfn.groupby('A').apply(lambda x: (x['C'] - x['D']))

A
bar  1   -0.565693
     3    0.689876
     5   -0.052429
foo  0    0.336602
     2   -0.752912
     4    0.115801
     6    0.431485
     7   -0.623085
dtype: float64

In [232]:
dfn.groupby('A')[['C','D']].apply(lambda x: x.sum())

            C         D
A
bar  1.638256  1.566501
foo  1.708709  2.200818

In [219]:

dfn.groupby('A').apply(lambda x: (x['C'] - x['D']).mean())

A
bar    0.023918
foo   -0.098422
dtype: float64

In [220]:
dfn.groupby('A').apply(lambda x: (x.mean())/x.std())

            C         D
A
bar  1.524077  1.211437
foo  1.475015  1.182632

In [233]:
dfn.groupby('A').apply(lambda x: print(x))

     A      B         C         D
1  bar    one  0.133956  0.699649
3  bar  three  0.720607  0.030732
5  bar    two  0.783693  0.836121
     A      B         C         D
1  bar    one  0.133956  0.699649
3  bar  three  0.720607  0.030732
5  bar    two  0.783693  0.836121
     A      B         C         D
0  foo    one  0.422782  0.086180
2  foo    two  0.229944  0.982856
4  foo    two  0.351262  0.235461
6  foo    one  0.664877  0.233392
7  foo  three  0.039844  0.662929

Empty DataFrame
Columns: []
Index: []

In [222]:
dfn.groupby('A').transform(lambda x: (x.mean())/x.std())

          C         D
0  1.475015  1.182632
1  1.524077  1.211437
2  1.475015  1.182632
3  1.524077  1.211437
4  1.475015  1.182632
5  1.524077  1.211437
6  1.475015  1.182632
7  1.475015  1.182632

In [223]:
m = np.random.random((4,5))*10
m = np.floor(m)
mdf = pd.DataFrame(m, columns = list('abcde'))
mdf

     a    b    c    d    e
0  4.0  2.0  4.0  7.0  0.0
1  2.0  1.0  7.0  9.0  9.0
2  5.0  8.0  4.0  1.0  8.0
3  8.0  5.0  5.0  5.0  8.0

In [238]:
mdf[mdf['a'].isin([4,6])]

     a    b    c    d    e
0  4.0  2.0  4.0  7.0  0.0

### Documentation

apply() would give error in case if we used it for the whole dataframe (by doing x - x.mean()) insatead of a Series. 
Apply fails to broadcast the values to each rows in case of dataframe.

#dfn.groupby('A').apply(lambda x: (x - x.mean())/x.std())

More details on https://stackoverflow.com/questions/27517425/apply-vs-transform-on-a-group-object 

== There are two major differences between the transform and apply groupby methods.== 

apply implicitly passes all the columns for each group as a DataFrame to the custom function, while transform passes each column for each group as a Series to the custom function

The custom function passed to apply can return a scalar, or a Series or DataFrame (or numpy array or even list). The custom function passed to transform must return a sequence (a one dimensional Series, array or list) the same length as the group.

== another blog on aggregate function ==
https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/

In [225]:
dfn.groupby('A')['C'].apply(lambda x: (x - x.mean())/x.std())

0    0.349782
1   -1.150217
2   -0.482538
3    0.487076
4    0.041092
5    0.663142
6    1.394705
7   -1.303042
Name: C, dtype: float64

In [226]:
# The advantage of transform() over apply() is the ability to broadcast function results to each elements in the column
dfn.groupby('A').transform(lambda x: (x - x.mean())/x.std())

          C         D
0  0.349782 -0.951083
1 -1.150217  0.411760
2 -0.482538  1.458106
3  0.487076 -1.140139
4  0.041092 -0.549994
5  0.663142  0.728379
6  1.394705 -0.555554
7 -1.303042  0.598526

### Documentation
Tidy data exercise for pandas -> http://tomaugspurger.github.io/modern-5-tidy.html#fnref:1

Using pandas for large data https://www.dataquest.io/blog/pandas-big-data/